Revit 2027 API
IFCTransaction.RollBack Method
 Rolls back all changes made to the IFC file during the transaction.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RollBack()
Public Sub RollBack
public:
void RollBack()
member RollBack : unit -> unit
See Also
Reference
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace